20240203T020208--kdoc-67-2023年のまとめ__draft_essay.org
:PROPERTIES:
:ID:       20240203T020208
:END:
#+title:      KDOC 67: 2023年のまとめ
#+date:       [2024-02-03 Sat 02:02]
#+filetags:   :draft:essay:
#+identifier: 20240203T020208

* この文書のステータス
- 作成
  - [X] 2024-02-03 貴島
- レビュー
* 概要
2023年に何してたかを振り返る。
* 仕事
仕事はPHP・Goをずっとやっていた。一人バックエンドだったのであまり学びがあるとは感じなかったが、なんとかひとり頑張ることで殻を破れた部分もあった。社外の人と働く経験は悪くなかった。ガンガン提案や調整した。[[id:a833c386-3cca-49eb-969a-5af58991250d][OpenAPI]]を使った開発をして最大限利用できるようになった。なんだかんだ、業務レベルのソフトウェアをゼロから設計する経験は貴重であった。
* プライベート
プライベートでは、だいたいコード書いたり本を読んだりしていた。[[id:7cacbaa3-3995-41cf-8b72-58d6e07468b1][Go]]が多く、すっかり手慣れた感じがある。

プログラム関連。

- Goで小さなツールをいくつか作った。10個くらい
- 小さなCPUエミュレータを作った。あまり身についたとは言えないが、感覚は身についた
- [[id:1125139c-d69f-4af0-a564-6b9b399ce976][Ebitengine]]でECSを取り込んで割と本格的な機構をもったゲームを途中までつくった。プライベートでのゲーム開発はこれまで何回も挫折してきた。今回はいつもと違い、自分でコントロールしている感がある。自分で思いついたことを実装できている
- 本は何読んだかあまり覚えてない。漫画やアニメや映画をちょくちょく見ているはずだが、全然残ってない

社会生活関連。

- 悲(悔)しい出来事があったが、人間として成長するよい機会だったと思える。そもそももっと若いうちに経験しておくべきことであった
- 前半は週5で出社していた。後半は週に2回程度出社した。オフィスは居心地がよくて楽しい
- よく昼や夜に同僚を誘い、飯を食べに行った。単純にその瞬間も楽しかったし、仲良くなって仕事も楽しくなったように感じた。さまざまな街へ飲みにいった。赤坂、新橋、飯田橋、町田、登戸、新宿、渋谷
- 物心ついてから初めての結婚式に出た。他人同士が家族となる瞬間に立ち会ったことが不思議な感じがした
- 初めて社外のプログラマーとの立食会に出た
- 初めて新幹線で博多に行った
* 関連
- [[id:20230101T175751][KDOC 16: 2022年のまとめ]]。去年のまとめ。
