20240203T020208--kdoc-67-2023年のまとめ__draft_essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-04 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 67: 2023年のまとめ</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 67: 2023年のまとめ</h1>

<div id="outline-container-org2ea53be" class="outline-2">
<h2 id="org2ea53be"><a href="#org2ea53be">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org2ea53be">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-03 貴島</li>
</ul></li>
<li>レビュー</li>
</ul>
</div>
</div>
<div id="outline-container-org95cd6d6" class="outline-2">
<h2 id="org95cd6d6"><a href="#org95cd6d6">概要</a></h2>
<div class="outline-text-2" id="text-org95cd6d6">
<p>
2023年に何してたかを振り返る。
</p>
</div>
</div>
<div id="outline-container-org16c65f8" class="outline-2">
<h2 id="org16c65f8"><a href="#org16c65f8">仕事</a></h2>
<div class="outline-text-2" id="text-org16c65f8">
<p>
仕事はPHP・Goをずっとやっていた。一人バックエンドだったのであまり学びがあるとは感じなかったが、なんとかひとり頑張ることで殻を破れた部分もあった。社外の人と働く経験は悪くなかった。ガンガン提案や調整した。<a href="20230119001157-openapi.html#ID-a833c386-3cca-49eb-969a-5af58991250d">OpenAPI</a>を使った開発をして最大限利用できるようになった。なんだかんだ、業務レベルのソフトウェアをゼロから設計する経験は貴重であった。
</p>
</div>
</div>
<div id="outline-container-orga855f58" class="outline-2">
<h2 id="orga855f58"><a href="#orga855f58">プライベート</a></h2>
<div class="outline-text-2" id="text-orga855f58">
<p>
プライベートでは、だいたいコード書いたり本を読んだりしていた。<a href="20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a>が多く、すっかり手慣れた感じがある。
</p>

<p>
プログラム関連。
</p>

<ul class="org-ul">
<li>Goで小さなツールをいくつか作った。10個くらい</li>
<li>小さなCPUエミュレータを作った。あまり身についたとは言えないが、感覚は身についた</li>
<li><a href="20230326190222-ebitengine.html#ID-1125139c-d69f-4af0-a564-6b9b399ce976">Ebitengine</a>でECSを取り込んで割と本格的な機構をもったゲームを途中までつくった。プライベートでのゲーム開発はこれまで何回も挫折してきた。今回はいつもと違い、自分でコントロールしている感がある。自分で思いついたことを実装できている</li>
<li>本は何読んだかあまり覚えてない。漫画やアニメや映画をちょくちょく見ているはずだが、全然残ってない</li>
</ul>

<p>
社会生活関連。
</p>

<ul class="org-ul">
<li>悲(悔)しい出来事があったが、人間として成長するよい機会だったと思える。そもそももっと若いうちに経験しておくべきことであった</li>
<li>前半は週5で出社していた。後半は週に2回程度出社した。オフィスは居心地がよくて楽しい</li>
<li>よく昼や夜に同僚を誘い、飯を食べに行った。単純にその瞬間も楽しかったし、仲良くなって仕事も楽しくなったように感じた。さまざまな街へ飲みにいった。赤坂、新橋、飯田橋、町田、登戸、新宿、渋谷</li>
<li>物心ついてから初めての結婚式に出た。他人同士が家族となる瞬間に立ち会ったことが不思議な感じがした</li>
<li>初めて社外のプログラマーとの立食会に出た</li>
<li>初めて新幹線で博多に行った</li>
</ul>
</div>
</div>
<div id="outline-container-orgf94c8d5" class="outline-2">
<h2 id="orgf94c8d5"><a href="#orgf94c8d5">関連</a></h2>
<div class="outline-text-2" id="text-orgf94c8d5">
<ul class="org-ul">
<li><a href="20230101T175751--kdoc-16-2022年のまとめ__essay.html#ID-20230101T175751">KDOC 16: 2022年のまとめ</a>。去年のまとめ。</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
